In [5]:
import pandas as pd
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [8]:
#reindex()
obj=obj.reindex(['a', 'c', 'd', 'b'])
obj

a   -5.3
c    3.6
d    4.5
b    7.2
dtype: float64

In [20]:
import numpy as np
#drop()
obj = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [21]:
obj.drop(labels=['c','d'],inplace=True)
obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [25]:
dataFrame = pd.DataFrame(np.arange(16).reshape(4,4),
                   index = ['台北','台中', '台南', '高雄'],
                   columns = ['one', 'two', 'three', 'four']
                   )
dataFrame

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [26]:
dataFrame.drop(labels=['台北','台中'],axis=0)

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [30]:
dataFrame.drop(labels=['one','two'],axis='columns')

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [31]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [32]:
data['two']

台北     1
台中     5
台南     9
高雄    13
Name: two, dtype: int64

In [33]:
data[['two','three']]

    two  three
台北    1      2
台中    5      6
台南    9     10
高雄   13     14

In [36]:
data[data < 5] = 0
data

    one  two  three  four
台北    0    0      0     0
台中    0    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [37]:
#loc[],iloc[]
data.loc['台北',['two','three']]

two      0
three    0
Name: 台北, dtype: int64

In [38]:
data.iloc[0,[1,2]]

two      0
three    0
Name: 台北, dtype: int64

In [39]:
data.loc['台南']

one       8
two       9
three    10
four     11
Name: 台南, dtype: int64

In [40]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: 台南, dtype: int64

In [42]:
data.iloc[2,:3]

one       8
two       9
three    10
Name: 台南, dtype: int64